#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

data.aws_iam_role.name: Reading...
data.aws_vpcs.selected: Reading...
data.aws_iam_role.name: Read complete after 0s [id=LabRole]
data.aws_vpcs.selected: Read complete after 0s [id=us-east-1]
data.aws_subnets.selected: Reading...
data.aws_subnets.selected: Read complete after 0s [id=us-east-1]
data.aws_subnet.selected["subnet-0ce3fcc2791a575a1"]: Reading...
data.aws_subnet.selected["subnet-045bd3642cf85bbee"]: Reading...
data.aws_subnet.selected["subnet-0ec5dba8893985b0e"]: Reading...
data.aws_subnet.selected["subnet-0ffdb76131a10cb4a"]: Reading...
data.aws_subnet.selected["subnet-01384f326c54262f5"]: Reading...
data.aws_subnet.selected["subnet-0882ea5606dafb700"]: Reading...
data.aws_subnet.selected["subnet-01384f326c54262f5"]: Read complete after 1s [id=subnet-01384f326c54262f5]
data.aws_subnet.selected["subnet-0ffdb76131a10cb4a"]: Read complete after 1s [id=subnet-0ffdb76131a10cb4a]
data.aws_subnet.selected["subnet-045bd3642cf85bbee"]: Read complete after 1s [id=subnet-045bd3642cf85bbee]
data.aws_subnet.selected["subnet-0ce3fcc2791a575a1"]: Read complete after 1s [id=subnet-0ce3fcc2791a575a1]
data.aws_subnet.selected["subnet-0ec5dba8893985b0e"]: Read complete after 1s [id=subnet-0ec5dba8893985b0e]
data.aws_subnet.selected["subnet-0882ea5606dafb700"]: Read complete after 1s [id=subnet-0882ea5606dafb700]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_cluster.eks-techlanches will be created
  + resource "aws_eks_cluster" "eks-techlanches" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "eks-techlanches"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::637423589454:role/LabRole"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = "1.29"

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = "10.100.0.0/16"
          + service_ipv6_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = [
              + "subnet-01384f326c54262f5",
              + "subnet-0882ea5606dafb700",
              + "subnet-0ce3fcc2791a575a1",
              + "subnet-0ec5dba8893985b0e",
              + "subnet-0ffdb76131a10cb4a",
            ]
          + vpc_id                    = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @aoliveiramateus, Action: `pull_request`*